## prod
#### Terraform Initialization :gear: `success`
#### Terraform Plan :book: `success`

<details><summary>Show Plan</summary>

```terraform
module.GKE.module.vpc.google_compute_network.my_vpc: Refreshing state... [id=projects/guitarnetes1/global/networks/gke-vpc-1]
module.GKE.module.vpc.google_compute_address.nat: Refreshing state... [id=projects/guitarnetes1/regions/us-east1/addresses/cluster-nat]
module.GKE.module.vpc.google_compute_router.router: Refreshing state... [id=projects/guitarnetes1/regions/us-east1/routers/router]
module.GKE.module.subnet.google_compute_subnetwork.private_subnet: Refreshing state... [id=projects/guitarnetes1/regions/us-east1/subnetworks/private-subnet]
module.GKE.google_container_cluster.primary: Refreshing state... [id=projects/guitarnetes1/locations/us-east1/clusters/guitarnetes-gke]
module.GKE.module.vpc.google_compute_router_nat.nat: Refreshing state... [id=guitarnetes1/us-east1/router/cluster-nat]
module.GKE.module.node_pool.data.google_container_engine_versions.gke_version: Reading...
module.GKE.module.node_pool.data.google_container_engine_versions.gke_version: Read complete after 1s [id=2023-11-09 12:22:47.795225972 +0000 UTC]
module.GKE.module.node_pool.google_container_node_pool.primary_nodes: Refreshing state... [id=projects/guitarnetes1/locations/us-east1/clusters/guitarnetes-gke/nodePools/node-pool]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.GKE.module.node_pool.google_container_node_pool.primary_nodes has been deleted
  - resource "google_container_node_pool" "primary_nodes" {
        id             = "projects/guitarnetes1/locations/us-east1/clusters/guitarnetes-gke/nodePools/node-pool"
      - name           = "node-pool" -> null
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.GKE.module.node_pool.google_container_node_pool.primary_nodes will be created
  + resource "google_container_node_pool" "primary_nodes" {
      + cluster                     = "guitarnetes-gke"
      + id                          = (known after apply)
      + initial_node_count          = (known after apply)
      + instance_group_urls         = (known after apply)
      + location                    = "us-east1"
      + managed_instance_group_urls = (known after apply)
      + max_pods_per_node           = (known after apply)
      + name                        = "node-pool"
      + name_prefix                 = (known after apply)
      + node_count                  = 1
      + node_locations              = (known after apply)
      + operation                   = (known after apply)
      + project                     = "guitarnetes1"
      + version                     = "1.27.4-gke.900"

      + node_config {
          + disk_size_gb      = (known after apply)
          + disk_type         = (known after apply)
          + effective_taints  = (known after apply)
          + guest_accelerator = (known after apply)
          + image_type        = (known after apply)
          + labels            = {
              + "env" = "guitarnetes1"
            }
          + local_ssd_count   = (known after apply)
          + logging_variant   = (known after apply)
          + machine_type      = "n1-standard-1"
          + metadata          = {
              + "disable-legacy-endpoints" = "true"
            }
          + min_cpu_platform  = (known after apply)
          + oauth_scopes      = [
              + "https://www.googleapis.com/auth/logging.write",
              + "https://www.googleapis.com/auth/monitoring",
            ]
          + preemptible       = false
          + service_account   = (known after apply)
          + spot              = false
          + tags              = [
              + "gke-node",
              + "guitarnetes1-gke",
            ]
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

Pusher: @Yanirw, Action: `pull_request`

Comment to apply these changes to the current environment